from os.path import sep
# 一,输出函数：
# sep 表示","的替换
print("123","123","345",sep="1",end="000")
print("2026","7","6",sep="/",end="???")
text1 = "114514"
text2 = "???"
print(text1,text2,sep="!!!",end=text1)
# 二，输出函数:
A = input("5418814524")
# 三，格式化输出之占位符
B = 999
print("%10d"%B)
print("%%"%())
swp = input("请输入密码")
print(swp)
# %s (字符串)
name1 = "？？？"
print("my name is: %s"% name1)
 # 占位符只是占据位置，并不会被输出
# %d(整数)
age2=18
name2 = "???"
print("my name is:%s,年龄:%d"%(name2 , age2))
# %4d(整数)
# 数字设置位数，不足前面自动补空白,超出则原样输出
a0 = 123
print("%3d"%a0)
# 若想要将自动将空白填成0，则将”%3d“改为”%03d“
# %f（浮点数）
a1 = 1.2
print("%f" %a1)
# 默认后六位小数，遵循四舍五入原则
# %.3f
# 用来调整小数位数(这里示例是3个)
b = 2.3456
print("%.3f"%b)
# % %(连在一起)
# 要在字符串中显示%，必须用% %转义,否则会被解析为占位符，导致错误
print("I am %% and %%")
# 四，转义字符
# \t为制表符，表示空4个格
print("1123\tt12345")
print("2123\tt12345")
print("3123\tt12345")
inf1 = input("姓名\t年龄\t邮箱")
# \n为换行符，表示换行
inf2 = input("name\nage\nemail")
print(inf1,inf2)
# \r回车，水平移动，回到行首
#自老式电传打字机。打字机有两个动作：
# 回车（\r）：把承载纸张的“滑架”（Carriage）拉回到最右侧（行首）。
# 换行（\n）：转动滚筒，把纸张向上卷一行。
# 所以在机械时代，要开始新的一行，必须先回车，再换行，也就是 \r\n。
print("???\r1145141")
#反斜杠符\\,用来输出斜杠，直接\会被误认为指令
print("114\\514")
# raw string 原始字符串 r
# 即如果在“”前加r就会取消“”中的转义。eg:
print(r"54188\r14524")
